type Contents = [string, string[]][];

const dropDownContents: Contents = [
  [
    "신입 개발자입니다.",
    [
      "제가 작성한 코드가 그대로 화면에 반영되는것에 흥미를 느껴 프론트엔드 개발 세계에 입문하게 되었습니다.",
      "고등학교 때 부터 줄곧 공부만 해오면서 처음으로 공부가 재밌다는 느낌을 받아서 개발이 제 길이라는 것을 확신하게 되었습니다.",
    ],
  ],
  [
    "기반을 다지면서 나아가는 개발자입니다.",
    [
      "기록하며 개발하는 것을 좋아합니다.",
      "부트캠프 4달간의 기본기 교육을 매일매일 블로그에 기록해 놓았으며 Javascript 기본 동작원리 공부를 위해 900p 상당의 기술서적을 블로그에 정리하며 공부했습니다.",
      "최근에는 SSR 뿐만 아니라 Caching, Pre-fetching 기능등 최적화가 강력한 Next.js 에 관심이 생겨서 공식문서를 보면서 정리 해보고 있습니다.",
    ],
  ],
  [
    "코드작성 실습을 하면서 익히려고 노력합니다.",
    [
      "바닐라 JS 연습을 위해 타자연습게임을 만들면서 DOM 조작 및 css 레이아웃 코드 작성 방법을 익혔습니다.",
      "typescript를 익히기 위해 책을 정리하면서 예제를 하나하나 만들어보며 어떻게 동작하는지 실습을 해보았습니다.",
    ],
  ],
  [
    "배우고 익힌것을 바탕으로 실제 프로젝트를 만들어봅니다.",
    [
      "두 개의 개인 프로젝트를 진행하면서 코드 작성흐름을 파악하였고, 자주 사용되는 UI, 기능들을 구현해보았습니다.",
      "두 개의 그룹 프로젝트를 해 보면서 프론트엔드와 백엔드, 프론트엔드와 프론트엔드 사이의 상호작용과 소통하는것에 대해 배울 수 있었습니다.",
      "여러 프로젝트를 진행하면서 저만의 기준(폴더 구조, 코드 컨벤션 등)을 잡아가고 있고, git 사용법에 대해서도 학습해 나가는 중입니다.",
    ],
  ],
];
export default dropDownContents;
